0/U
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2312                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volVectorField;
    object      U;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 -1 0 0 0 0];

internalField   uniform (0 0 0);

boundaryField
{
    walls
    {
        type            pressureInletOutletVelocity;
        value           uniform (0 0 0);
    }

    vent
    {
        type            fixedValue;
        value           uniform (0 -15.873 0);
    }

    toilet
    {
        type            noSlip;
    }
    human
    {
        type            noSlip;
    }
    floor
    {
        type            noSlip;
    }
    symmCut
    {
        type            symmetryPlane;
    }
}


// ************************************************************************* //
